package practical_multithread.all;
/**
 *Задача:
 * Вы должны создать программу на Java, которая решает следующую задачу: программа должна найти и
 * вывести все простые числа в заданном диапазоне (например, от 1 до 100). Простые числа - это натуральные
 * числа больше 1, которые делятся только на 1 и на сами себя.
 *
 * Ваше решение должно включать в себя следующие шаги:
 *
 * Запросить у пользователя верхний и нижний пределы диапазона для поиска простых чисел.
 *
 * Проверить каждое число в заданном диапазоне, начиная с нижнего предела и заканчивая верхним пределом.
 *
 * Для каждого числа проверить, является ли оно простым.
 *
 * Если число простое, вывести его на экран.
 */
public class practicalTaskSingleThreading {


































    /**
     * import java.util.Scanner;
     *
     * public class PrimeNumberFinder {
     *     public static void main(String[] args) {
     *         Scanner scanner = new Scanner(System.in);
     *
     *         System.out.print("Введите нижний предел диапазона: ");
     *         int lowerLimit = scanner.nextInt();
     *
     *         System.out.print("Введите верхний предел диапазона: ");
     *         int upperLimit = scanner.nextInt();
     *
     *         System.out.println("Простые числа в диапазоне от " + lowerLimit + " до " + upperLimit + ":");
     *         for (int number = lowerLimit; number <= upperLimit; number++) {
     *             if (isPrime(number)) {
     *                 System.out.print(number + " ");
     *             }
     *         }
     *     }
     *
     *     // Метод для проверки, является ли число простым
     *     public static boolean isPrime(int number) {
     *         if (number <= 1) {
     *             return false;
     *         }
     *         for (int i = 2; i <= Math.sqrt(number); i++) {
     *             if (number % i == 0) {
     *                 return false;
     *             }
     *         }
     *         return true;
     *     }
     * }
     */
}
